Repository: Alexandru-Dobre/vads-payment-php
Catalog: lib/i18n/*.po
Languages: fr

source: please fill your site ID in
fr: Merci d'ajouter votre identifiant boutique dans

source: find some help on payzen.io
fr: Trouvez de l'aide sur payzen.io

source: please fill your certificate (TEST-version) in
fr: Merci de remplir votre certificat (version TEST) dans

source: please fill your certificate (PRODUCTION) in
fr: Merci d'ajouter votre certificat (de PRODUCTION) dans

source: ### ERROR - An exception raised during IPN PayZen process:
fr: ###ERREUR - une erreur est survenue pendant le process IPN

source: INVALID SIGNATURE
fr: Signature Invalide

source: Status
fr: Statut

source: The payment was abandonned by the customer. The transaction was not created on the gateway and therefore is not visible on the merchant back office.
fr: Le paiement a été abandonné par le client. La transaction n’a pas été crée sur la plateforme de paiement et n’est donc pas visible dans le back office marchand.

source: The payment is accepted and is waiting to be cashed.
fr: Le paiement a été accepté et est en attente de remise en banque.

source: The payment was refused.
fr: Le paiement a été refusé.

source: The transaction is accepted but it is waiting to be manually validated. It is on the merchant responsability to validate the transaction in order that it can be cashed from the back office or by web service request. The transaction can be validated as long as the capture delay is not expired. If the delay expires the payment status change to Expired. This status is definitive.
fr: La transaction a été acceptée mais elle est en attente de validation manuelle. C'est à la charge du marchand de valider la transaction pour demander la remise en banque depuis le back office marchand ou par requête web service. La transaction pourra être validée tant que le délai de capture n’a pas été dépassé. Si ce délai est dépassé alors le paiement bascule dans le statut Expiré. Ce statut expiré est définitif.

source: The transaction is waiting for an authorisation. During the payment, just an imprint was made because the capture delay is higher than 7 days. By default the auhorisation demand for the global amount will be made 2 days before the bank deposit date.
fr: La transaction est en attente d’autorisation. Lors du paiement uniquement un prise d’empreinte a été réalisée car le délai de remise en banque est strictement supérieur à 7 jours. Par défaut la demande d’autorisation pour le montant global sera réalisée à j-2 avant la date de remise en banque."; $La_transaction_est_expiree = "La transaction est expirée. Ce statut est définitif, la transaction ne pourra plus être remisée en banque. Une transaction expire dans le cas d'une transaction créée en validation manuelle ou lorsque le délai de remise en banque (capture delay) dépassé.

source: The transaction expired. This status is definitive, the transaction will not be able to be cashed. A transaction expires when it was created in manual validation or when the capture delay is passed.
fr: La transaction est expirée. Ce statut est définitif, la transaction ne pourra plus être remisée en banque. Une transaction expire dans le cas d'une transaction créée en validation manuelle ou lorsque le délai de remise en banque (capture delay) dépassé.

source: The payment was cancelled through the merchant back offfice or by a web service request. This status is definitive, the transaction will never be cashed.
fr: La transaction a été annulée au travers du back office marchand ou par une requête web service. Ce statut est définitif, la transaction ne sera jamais remise en banque.

source: The transaction is waiting for an authorisation and a manual validation. During the payment, just an imprint was made because the capture delay is higher than 7 days and the validation type is « manual validation ». This payment will be able to be cashed only after that the merchant validates it from the back office or by web service request.
fr: La transaction est en attente d’autorisation et en attente de validation manuelle. Lors du paiement uniquement un prise d’empreinte a été réalisée car le délai de remise en banque est strictement supérieur à 7 jours et le type de validation demandé est « validation manuelle ». Ce paiement ne pourra être remis en banque uniquement après une validation du marchand depuis le back office marchand ou par un requête web services.

source: The payment was cashed. This status is definitive.
fr: La transaction a été remise en banque. Ce statut est définitif.

source: Result
fr: Résultat

source: Payment successfully completed.
fr: Paiement réalisé avec succès.

source: The merchant must contact the holder’s bank.
fr: Le commerçant doit contacter la banque du porteur.

source: Payment denied.
fr: Paiement refusé.

source: Cancellation by customer.
fr: Paiement annulé par le client.

source: Request format error. To be linked with the value of the vads_extra_result field.
fr: Erreur de format de la requête. A mettre en rapport avec la valorisation du champ vads_extra_result.

source: Technical error occurred during payment.
fr: Erreur technique lors du paiement.

source: ID
fr: Identifiant

source: amount
fr: Montant

source: Effective amount
fr: Montant Effectif

source: Payment Type
fr: Type de paiement

source: Unique Payment.
fr: Paiement simple.

source: Installment Payment.
fr: Paiement en plusieurs fois

source: Sequence Number
fr: Numéro de séquence

source: Authorisation Result
fr: Résultat d'autorisation

source: Transaction approved or successfully treated.
fr: Transaction approuvée ou traitée avec succès.

source: Contact the card issuer.
fr: Contacter l’émetteur de carte.

source: Invalid acceptor.
fr: Accepteur_invalide.

source: Keep the card.
fr: Conserver la carte.

source: Do not honor.
fr: Ne pas honorer.

source: Keep the card, special conditions.
fr: Conserver la carte, conditions spéciales.

source: Approved after identification.
fr: Approuver après identification.

source: Invalid Transaction.
fr: Transaction invalide.

source: Invalid Amount.
fr: Montant invalide.

source: Invalid holder number.
fr: Numéro de porteur invalide.

source: Format error.
fr: Erreur de format.

source: Unknown buying organization identifier.
fr: Identifiant de l’organisme acquéreur inconnu.

source: Expired card validity date.
fr: Date de validité de la carte dépassée.

source: Fraud suspected.
fr: Suspicion de fraude.

source: Lost card.
fr: Carte perdue.

source: Stolen card.
fr: Carte volée.

source: Insufficient provision or exceeds credit.
fr: Provision insuffisante ou crédit dépassé.

source: Card not in database.
fr: Carte absente du fichier.

source: Transaction not allowed for this holder.
fr: Transaction non permise à ce porteur.

source: Transaction not allowed from this terminal.
fr: Transaction interdite au terminal.

source: The card acceptor must contact buyer.
fr: L’accepteur de carte doit contacter l’acquéreur.

source: Amount over withdrawal limits.
fr: Montant de retrait hors limite.

source: Does not abide to security rules.
fr: Règles de sécurité non respectées.

source: Response not received or received too late.
fr: Réponse non parvenue ou reçue trop tard.

source: System temporarily stopped.
fr: Arrêt momentané du système.

source: Inaccessible card issuer.
fr: Emetteur de cartes inaccessible.

source: Duplicated transaction.
fr: Transaction dupliquée.

source: Faulty system.
fr: Mauvais fonctionnement du système.

source: Global surveillance time out expired.
fr: Echéance de la temporisation de surveillance globale.

source: Unavailable server, repeat network routing requested.
fr: Serveur indisponible routage réseau demandé à nouveau.

source: Instigator domain incident.
fr: Incident domaine initiateur.

source: Payment Warranty
fr: Garantie de paiement

source: Payment is guaranteed.
fr: Le paiement est garanti.

source: Payment is not guaranteed.
fr: Le paiement n’est pas garanti.

source: Payment cannot be guaranteed, due to a technical error.
fr: Suite à une erreur technique, le paiement ne peut pas être garanti.

source: Payment guarantee not applicable.
fr: Garantie de paiement non applicable.

source: 3DS Authentified.
fr: Authentifié 3DS.

source: Authentification Error.
fr: Erreur Authentification.

source: Try to authenticate.
fr: Essai d’authentification.

source: Non valued.
fr: Non renseigné.

source: Capture delay
fr: Délai avant Remise en Banque

source: days
fr: jours

source: Validation Mode
fr: Mode de Validation

source: Manual Validation
fr: Validation Manuelle

source: Automatic Validation
fr: Validation Automatique

source: Default configuration of the merchant back office
fr: Configuration par défaut du back office marchand
