Repository: Alexandru-Dobre/vads-payment-php
Catalog: lib/locale/*/LC_MESSAGES/messages.po
Languages: fr_fr

source: Pay
fr_fr: Payer

source: Price
fr_fr: Prix

source: Display only the price to pay
fr_fr: Afficher uniquement le prix à payer

source: Payment form
fr_fr: Formulaire de paiement

source: BELOW IS THE DATA WHICH WILL BE SENT TO THE GATEWAY
fr_fr: POUR INFORMATION VOICI LES CHAMPS QUI SERONT ENVOYES A LA PLATEFORME

source: NOTE:
fr_fr: REMARQUE:

source: In order to be redirected straight to the payment gateway, you need to change the debug value of the config.php file to false.
fr_fr: Pour etre redirigé directement sur la page de paiement sans afficher cette page, veuillez passer la valeur debug à <code>false</code> dans le fichier config.php

source: Contact us
fr_fr: Nous contacter

source: Language
fr_fr: Langue

source: PAYZEN PAYMENT SOLUTION IMPLEMENTATION EXAMPLE
fr_fr: EXEMPLE D'IMPLEMENTATION DE LA SOLUTION DE PAIEMENT PAYZEN

source: The payment uses the sending of a payment form to PAYZEN payment gateway URL.
fr_fr: Le paiement s'appuie sur l'envoi d'un formulaire de paiement en https vers l'URL de la plateforme de paiement PAYZEN.

source: File
fr_fr: Fichier

source: Before the first use you have to fill the <code>shopID</code>, <code>certTest</code>, <code>platform</code> and <code>ctxMode</code> of the <code>config/config.php</code>.e. This file contains secure data. <b>This data securing is on your responsibility.</b>
fr_fr: Avant la première utilisation vous devez impérativement renseigner les champs <code>shopID</code>, <code>certTest</code>, <code>platform</code> et <code>ctxMode</code> du fichier <code>config/config.php</code>. Ce fichier comporte des données sensibles. <b>La sécurisation de ces données est de votre responsabilité.</b>

source: the file <code>html-form.php</code> sends these payment fields to the<code>form-tunnel.php</code> which fetch these fields to create the payment request.</p> <p>These fields are filled with examples, it is up to you to fill them depending on your context and configuration.</p> <p><b>Some other fields are available, PAYZEN support recommends to read the payment form documentation</b> <a href='https://payzen.io'>Read the documentation.</a>
fr_fr: Le fichier <code>html-form.php</code> envoie l'ensemble des champs liés au paiement vers le fichier <code>form-tunnel.php</code> qui récupère l'ensemble des ces champs pour construire la requête de paiement.</p> <p>Les champs sont renseignés à titre d'exemple, à votre charge de les valoriser en fonction de votre contexte.</p> <p><b>D'autres champs sont disponibles, le support PAYZEN vous invite à lire la documentation liée au formulaire de paiement</b> <a href="https://payzen.io">Consulter la documentation.</a>

source: TRANSACTION SETTINGS
fr_fr: PARAMETRES DE LA TRANSACTION

source: Order amount set in the smallest currency unit. Cents for EURO. Ex: 1000 for 10 euros
fr_fr: Montant de la commande exprimé dans la plus petite unité de la devise. Centimes pour EURO. Ex : 1000 pour 10 euros

source: CLIENT SETTINGS
fr_fr: PARAMETRES CLIENT

source: Order number. Optional setting. Length of field: 32 characters max - Alphanumeric Type
fr_fr: Numéro de commande. Paramètre facultatif. Longueur du champ: 32 caractères maximum - Type Alphanumérique

source: Customer number. Optional setting. Length of field: 32 characters max - Alphanumeric Type
fr_fr: Numéro client. Paramètre facultatif. Longueur du champ: 32 caractères maximum - Type Alphanumérique

source: Customer name. Optional setting. Length of field: 127 characters max - Alphanumeric Type
fr_fr: Nom du client. Paramètre facultatif. Longueur du champ: 127 caractères maximum - Type Alphanumérique

source: Customer address. Optional setting. Length of field: 255 characters max - Alphanumeric Type
fr_fr: Adresse du client. Paramètre facultatif. Longueur du champ: 255 caractères maximum - Type Alphanumérique

source: Customer Postal Code. Optional setting. Length of field: 32 characters max - Alphanumeric Type
fr_fr: Code Postal du client. Paramètre facultatif. Longueur du champ: 32 caractères maximum - Type Alphanumérique

source: Customer City. Optional setting. Length of field: 63 characters max - Alphanumeric Type
fr_fr: Ville du client. Paramètre facultatif. Longueur du champ: 63 caractères maximum - Type Alphanumérique

source: Customer Country. Customer country code according to the ISO 3166 norm. Optional setting. Length of field: 2 characters max - Alphanumeric Type
fr_fr: Pays du client. Code pays du client à la norme ISO 3166. Paramètre facultatif. Longueur du champ: 2 caractères maximum - Type Alphanumérique

source: Customer Phone Number. Optional setting. Length of field: 32 characters max - Alphanumeric Type
fr_fr: Téléphone du client. Paramètre facultatif. Longueur du champ: 32 caractères maximum - Type Alphanumérique

source: Customer Email. Optional setting.
fr_fr: Email du client. Paramètre facultatif.

source: RETURN URL
fr_fr: URL de retour

source: Default URL to where the buyer will be redirected. If this field has not been transmitted, the Back Office configuration will be taken into account.
fr_fr: URL où sera redirigé par défaut l’acheteur après un appui sur le bouton Retourner à la boutique, si les URL vads_url_error, vads_url_refused, vads_url_success ou vads_url_cancel ne sont pas renseignées.

source: delay in seconds before an automatic redirection to the merchant website at the end of an accepted payment.
fr_fr: Permet de définir un délai en secondes avant redirection automatique vers le site marchand à la fin d’un paiement accepté.

source: Validate and send the settings <br>by POST mode to
fr_fr: Valider et envoyer les paramètres <br>en mode POST vers le fichier

source: A starter kit with your PayZen Payment Form
fr_fr: Un kit de démarrage pour la paiement en ligne par formulaire

source: Requirements
fr_fr: Configuration nécessaire

source: In
fr_fr: Dans

source: Your SHOP ID
fr_fr: Votre identifiant boutique

source: Your Certificate (TEST or PRODUCTION)
fr_fr: Votre certificat (TEST ou PRODUCTION)

source: Platform URL
fr_fr: Url de la plateforme

source: Form Examples
fr_fr: Exemples de formulaires

source: Simple Form
fr_fr: Formulaire simple

source: Simple form with card pre-selected and return URL
fr_fr: Formulaire simple avec carte pre-selectionnée et retour à la boutique

source: Html form
fr_fr: Formulaire HTML

source: Installment payment
fr_fr: Paiement en plusieurs fois

source: Deferred payment
fr_fr: Paiement comptant différé

source: Authorization without capture
fr_fr: Demande d'autorisation

source: Monthly subscription
fr_fr: Abonnement au mois

source: Simple Form with Bootstrap
fr_fr: Formulaire simple avec la librairie Bootstrap

source: PAYMENT ANALYSIS
fr_fr: Analyse du paiement

source: When the payment is done, the gateway sends some parameters by POST mode to the server URL which analyzes the payment results. First you have to check the signature. If it is correct then you will be able to take the payment parameters into consideration.
fr_fr: Lorsque le paiement est terminé, la plateforme de paiement renvoie des paramètres en mode POST vers l'URL serveur qui doit analyser les résultats du paiement. Dans un premier temps il convient de vérifier la signature reçue. Si celle-ci est correcte alors vous pourrez prendre en considération les paramètres liés au paiement proprement dit.

source: In this package, the <code>form-return.php</code> file controls the signature and analyzes the payment results. First the script checks the signature and then analyzes the main fields. It is up to you to adapt the code to your context.
fr_fr: Dans ce pack, c'est le fichier <code>form-return.php</code> qui controle la signature et analyse les résultats du paiement. Le code est donné à titre d'exemple. Dans un premier temps le script vérifie la signature puis analyse les principaux champs. A vous d'adapter le code à votre contexte.

source: Return URLs
fr_fr: URL de retour

source: When the customer comes back to the shop through one of the return URLs, the payment parameters are sent back depending on the <code>vads_return_mode</code>. Depending on the <code>vads_return_mode</code> setting, the parameters are sent by POST mode, GET mode or not at all.
fr_fr: Lorsque l'internaute revient à la boutique via l'une des url de retour, les paramètres liés au paiement sont renvoyés en fonction de la variable <code>vads_return_mode</code> définie dans le fichier conf.txt. En fonction du <code>vads_return_mode</code> les paramètres sont renvoyés en mode POST / GET ou pas du tout.

source: Find HELP
fr_fr: Trouver de l'aide

source: The PAYZEN support recommends to read the settings analysis documentation
fr_fr: Le support de PayZen recommande fortement de lire la documentation

source: please fill your site ID in
fr_fr: Merci d'ajouter votre identifiant boutique dans

source: find some help on payzen.io
fr_fr: Trouvez de l'aide sur payzen.io

source: please fill your certificate (TEST-version) in
fr_fr: Merci de remplir votre certificat (version TEST) dans

source: please fill your certificate (PRODUCTION) in
fr_fr: Merci d'ajouter votre certificat (de PRODUCTION) dans

source: please fill the platform URL
fr_fr: Merci de préciser l'URL de la plateforme

source: ### ERROR - An exception raised during IPN PayZen process:
fr_fr: ###ERREUR - une erreur est survenue pendant le process IPN
